TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
       3                    ;* Date/Time created: Fri Nov 12 13:15:22 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../InputOutput.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\CE2007\CE2007Labs-Instructor-17072019\CE2007\Lab1_C_Progr
      13                            .global a
      14 00000000                   .sect   ".data:a", RW
      15                            .clink

    1485                            .dwattr $C$DW$63, DW_AT_TI_end_column(0x01)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   28

    1486                            .dwendentry
    1487                            .dwendtag $C$DW$63
    1488                    
    1489                    ;******************************************************************************
    1490                    ;* CONSTANT TABLE                                                             *
    1491                    ;******************************************************************************
    1492 000002f6                   .sect   ".text"
    1493                            .align  4
    1494 000002f6 4C0A46C0  ||$C$CON1||:    .bits   1073761290,32
         000002fa 00004000 
    1495                            .align  4
    1496 000002fa 4C0C4000  ||$C$CON2||:    .bits   1073761292,32
         000002fe 00004000 
    1497                            .align  4
    1498 000002fe 4C044000  ||$C$CON3||:    .bits   1073761284,32
         00000302 00004000 
    1499                            .align  4
    1500 00000302 4C064000  ||$C$CON4||:    .bits   1073761286,32
         00000306 00004000 
    1501                            .align  4
    1502 00000306 4C024000  ||$C$CON5||:    .bits   1073761282,32
         0000030a 00004000 
    1503                            .align  4
    1504 0000030a 4C004000  ||$C$CON6||:    .bits   1073761280,32
         0000030e 00004000 
    1505                            .align  4
    1506 0000030e 4C0B4000  ||$C$CON7||:    .bits   1073761291,32
         00000312 00004000 
    1507                            .align  4
    1508 00000312 4C0D4000  ||$C$CON8||:    .bits   1073761293,32
         00000316 00004000 
    1509                            .align  4
    1510 00000316 4C094000  ||$C$CON9||:    .bits   1073761289,32
         0000031a 00004000 
    1511                            .align  4
    1512 0000031a 4C054000  ||$C$CON10||:   .bits   1073761285,32
         0000031e 00004000 
    1513                            .align  4
    1514 0000031e 4C034000  ||$C$CON11||:   .bits   1073761283,32
         00000322 00004000 
    1515                            .align  4
    1516 00000322 00004000! ||$C$CON12||:   .bits   a_pointer,32
         00000326 00000000 
    1517                            .align  4
    1518 00000326 00000000! ||$C$CON13||:   .bits   a,32
         0000032a 00000000 
    1519                            .align  4
    1520 0000032a 80640000  ||$C$CON14||:   .bits   1107918948,32
         0000032e 00004209 
    1521                            .align  4
    1522 0000032e 80044209  ||$C$CON15||:   .bits   1107918852,32
         00000332 00004209 
    1523                            .align  4
    1524 00000332 80104209  ||$C$CON16||:   .bits   1107918864,32
         00000336 00004209 
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   29

    1525                            .align  4
    1526 00000336 80404209  ||$C$CON17||:   .bits   1107918912,32
         0000033a 00004209 
    1527                            .align  4
    1528 0000033a 80684209  ||$C$CON18||:   .bits   1107918952,32
         0000033e 00004209 
    1529                            .align  4
    1530 0000033e 80604209  ||$C$CON19||:   .bits   1107918944,32
         00000342 00004209 
    1531                    
    1532                    ;******************************************************************************
    1533                    ;* BUILD ATTRIBUTES                                                           *
    1534                    ;******************************************************************************
    1535                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    1536                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
    1537                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
    1538                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
    1539                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    1540                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    1541                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    1542                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
    1543                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
    1544                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    1545                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
    1546                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    1547                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    1548                    
    1549                    ;******************************************************************************
    1550                    ;* TYPE INFORMATION                                                           *
    1551                    ;******************************************************************************
    1552                    
    1553                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1554                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e)
    1555                    $C$DW$67        .dwtag  DW_TAG_member
    1556                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    1557                            .dwattr $C$DW$67, DW_AT_name("IN")
    1558                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("IN")
    1559                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1561                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1562                            .dwattr $C$DW$67, DW_AT_decl_line(0x288)
    1563                            .dwattr $C$DW$67, DW_AT_decl_column(0x0f)
    1564                    
    1565                    $C$DW$68        .dwtag  DW_TAG_member
    1566                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1567                            .dwattr $C$DW$68, DW_AT_name("RESERVED0")
    1568                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("RESERVED0")
    1569                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1570                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1571                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1572                            .dwattr $C$DW$68, DW_AT_decl_line(0x289)
    1573                            .dwattr $C$DW$68, DW_AT_decl_column(0x0b)
    1574                    
    1575                    $C$DW$69        .dwtag  DW_TAG_member
    1576                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   30

    1577                            .dwattr $C$DW$69, DW_AT_name("OUT")
    1578                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("OUT")
    1579                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1580                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1581                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1582                            .dwattr $C$DW$69, DW_AT_decl_line(0x28a)
    1583                            .dwattr $C$DW$69, DW_AT_decl_column(0x10)
    1584                    
    1585                    $C$DW$70        .dwtag  DW_TAG_member
    1586                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1587                            .dwattr $C$DW$70, DW_AT_name("RESERVED1")
    1588                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("RESERVED1")
    1589                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1590                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1591                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1592                            .dwattr $C$DW$70, DW_AT_decl_line(0x28b)
    1593                            .dwattr $C$DW$70, DW_AT_decl_column(0x0b)
    1594                    
    1595                    $C$DW$71        .dwtag  DW_TAG_member
    1596                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
    1597                            .dwattr $C$DW$71, DW_AT_name("DIR")
    1598                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("DIR")
    1599                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1600                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1601                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1602                            .dwattr $C$DW$71, DW_AT_decl_line(0x28c)
    1603                            .dwattr $C$DW$71, DW_AT_decl_column(0x10)
    1604                    
    1605                    $C$DW$72        .dwtag  DW_TAG_member
    1606                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1607                            .dwattr $C$DW$72, DW_AT_name("RESERVED2")
    1608                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("RESERVED2")
    1609                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1610                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1611                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1612                            .dwattr $C$DW$72, DW_AT_decl_line(0x28d)
    1613                            .dwattr $C$DW$72, DW_AT_decl_column(0x0b)
    1614                    
    1615                    $C$DW$73        .dwtag  DW_TAG_member
    1616                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
    1617                            .dwattr $C$DW$73, DW_AT_name("REN")
    1618                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("REN")
    1619                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1620                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1621                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1622                            .dwattr $C$DW$73, DW_AT_decl_line(0x28e)
    1623                            .dwattr $C$DW$73, DW_AT_decl_column(0x10)
    1624                    
    1625                    $C$DW$74        .dwtag  DW_TAG_member
    1626                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1627                            .dwattr $C$DW$74, DW_AT_name("RESERVED3")
    1628                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED3")
    1629                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1630                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1631                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   31

    1632                            .dwattr $C$DW$74, DW_AT_decl_line(0x28f)
    1633                            .dwattr $C$DW$74, DW_AT_decl_column(0x0b)
    1634                    
    1635                    $C$DW$75        .dwtag  DW_TAG_member
    1636                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    1637                            .dwattr $C$DW$75, DW_AT_name("DS")
    1638                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("DS")
    1639                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1640                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1641                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1642                            .dwattr $C$DW$75, DW_AT_decl_line(0x290)
    1643                            .dwattr $C$DW$75, DW_AT_decl_column(0x10)
    1644                    
    1645                    $C$DW$76        .dwtag  DW_TAG_member
    1646                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1647                            .dwattr $C$DW$76, DW_AT_name("RESERVED4")
    1648                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("RESERVED4")
    1649                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1650                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1651                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1652                            .dwattr $C$DW$76, DW_AT_decl_line(0x291)
    1653                            .dwattr $C$DW$76, DW_AT_decl_column(0x0b)
    1654                    
    1655                    $C$DW$77        .dwtag  DW_TAG_member
    1656                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
    1657                            .dwattr $C$DW$77, DW_AT_name("SEL0")
    1658                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("SEL0")
    1659                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1660                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1661                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1662                            .dwattr $C$DW$77, DW_AT_decl_line(0x292)
    1663                            .dwattr $C$DW$77, DW_AT_decl_column(0x10)
    1664                    
    1665                    $C$DW$78        .dwtag  DW_TAG_member
    1666                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1667                            .dwattr $C$DW$78, DW_AT_name("RESERVED5")
    1668                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("RESERVED5")
    1669                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1670                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1671                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1672                            .dwattr $C$DW$78, DW_AT_decl_line(0x293)
    1673                            .dwattr $C$DW$78, DW_AT_decl_column(0x0b)
    1674                    
    1675                    $C$DW$79        .dwtag  DW_TAG_member
    1676                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1677                            .dwattr $C$DW$79, DW_AT_name("SEL1")
    1678                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("SEL1")
    1679                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1680                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1681                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1682                            .dwattr $C$DW$79, DW_AT_decl_line(0x294)
    1683                            .dwattr $C$DW$79, DW_AT_decl_column(0x10)
    1684                    
    1685                    $C$DW$80        .dwtag  DW_TAG_member
    1686                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   32

    1687                            .dwattr $C$DW$80, DW_AT_name("RESERVED6")
    1688                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("RESERVED6")
    1689                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1690                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1691                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1692                            .dwattr $C$DW$80, DW_AT_decl_line(0x295)
    1693                            .dwattr $C$DW$80, DW_AT_decl_column(0x0b)
    1694                    
    1695                    $C$DW$81        .dwtag  DW_TAG_member
    1696                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$23)
    1697                            .dwattr $C$DW$81, DW_AT_name("IV")
    1698                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("IV")
    1699                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1700                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1701                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1702                            .dwattr $C$DW$81, DW_AT_decl_line(0x296)
    1703                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1704                    
    1705                    $C$DW$82        .dwtag  DW_TAG_member
    1706                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$24)
    1707                            .dwattr $C$DW$82, DW_AT_name("RESERVED7")
    1708                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("RESERVED7")
    1709                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1710                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1711                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1712                            .dwattr $C$DW$82, DW_AT_decl_line(0x297)
    1713                            .dwattr $C$DW$82, DW_AT_decl_column(0x0b)
    1714                    
    1715                    $C$DW$83        .dwtag  DW_TAG_member
    1716                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1717                            .dwattr $C$DW$83, DW_AT_name("SELC")
    1718                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("SELC")
    1719                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1720                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1721                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1722                            .dwattr $C$DW$83, DW_AT_decl_line(0x298)
    1723                            .dwattr $C$DW$83, DW_AT_decl_column(0x10)
    1724                    
    1725                    $C$DW$84        .dwtag  DW_TAG_member
    1726                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1727                            .dwattr $C$DW$84, DW_AT_name("RESERVED8")
    1728                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED8")
    1729                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1730                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1731                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1732                            .dwattr $C$DW$84, DW_AT_decl_line(0x299)
    1733                            .dwattr $C$DW$84, DW_AT_decl_column(0x0b)
    1734                    
    1735                    $C$DW$85        .dwtag  DW_TAG_member
    1736                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1737                            .dwattr $C$DW$85, DW_AT_name("IES")
    1738                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("IES")
    1739                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1740                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1741                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   33

    1742                            .dwattr $C$DW$85, DW_AT_decl_line(0x29a)
    1743                            .dwattr $C$DW$85, DW_AT_decl_column(0x10)
    1744                    
    1745                    $C$DW$86        .dwtag  DW_TAG_member
    1746                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1747                            .dwattr $C$DW$86, DW_AT_name("RESERVED9")
    1748                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED9")
    1749                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1750                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1751                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1752                            .dwattr $C$DW$86, DW_AT_decl_line(0x29b)
    1753                            .dwattr $C$DW$86, DW_AT_decl_column(0x0b)
    1754                    
    1755                    $C$DW$87        .dwtag  DW_TAG_member
    1756                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1757                            .dwattr $C$DW$87, DW_AT_name("IE")
    1758                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("IE")
    1759                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1760                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1761                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1762                            .dwattr $C$DW$87, DW_AT_decl_line(0x29c)
    1763                            .dwattr $C$DW$87, DW_AT_decl_column(0x10)
    1764                    
    1765                    $C$DW$88        .dwtag  DW_TAG_member
    1766                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1767                            .dwattr $C$DW$88, DW_AT_name("RESERVED10")
    1768                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("RESERVED10")
    1769                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1770                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1771                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1772                            .dwattr $C$DW$88, DW_AT_decl_line(0x29d)
    1773                            .dwattr $C$DW$88, DW_AT_decl_column(0x0b)
    1774                    
    1775                    $C$DW$89        .dwtag  DW_TAG_member
    1776                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
    1777                            .dwattr $C$DW$89, DW_AT_name("IFG")
    1778                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("IFG")
    1779                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1780                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1781                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1782                            .dwattr $C$DW$89, DW_AT_decl_line(0x29e)
    1783                            .dwattr $C$DW$89, DW_AT_decl_column(0x10)
    1784                    
    1785                    $C$DW$90        .dwtag  DW_TAG_member
    1786                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1787                            .dwattr $C$DW$90, DW_AT_name("RESERVED11")
    1788                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("RESERVED11")
    1789                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1790                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1791                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1792                            .dwattr $C$DW$90, DW_AT_decl_line(0x29f)
    1793                            .dwattr $C$DW$90, DW_AT_decl_column(0x0b)
    1794                    
    1795                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1796                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x287)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   34

    1797                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1798                            .dwendtag $C$DW$T$25
    1799                    
    1800                    $C$DW$T$172     .dwtag  DW_TAG_typedef
    1801                            .dwattr $C$DW$T$172, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    1802                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$25)
    1803                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    1804                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1805                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x2a0)
    1806                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
    1807                    
    1808                    
    1809                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1810                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
    1811                    $C$DW$91        .dwtag  DW_TAG_member
    1812                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1813                            .dwattr $C$DW$91, DW_AT_name("RESERVED0")
    1814                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("RESERVED0")
    1815                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1816                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1817                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1818                            .dwattr $C$DW$91, DW_AT_decl_line(0x2a3)
    1819                            .dwattr $C$DW$91, DW_AT_decl_column(0x0b)
    1820                    
    1821                    $C$DW$92        .dwtag  DW_TAG_member
    1822                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    1823                            .dwattr $C$DW$92, DW_AT_name("IN")
    1824                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("IN")
    1825                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1826                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1827                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1828                            .dwattr $C$DW$92, DW_AT_decl_line(0x2a4)
    1829                            .dwattr $C$DW$92, DW_AT_decl_column(0x0f)
    1830                    
    1831                    $C$DW$93        .dwtag  DW_TAG_member
    1832                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1833                            .dwattr $C$DW$93, DW_AT_name("RESERVED1")
    1834                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("RESERVED1")
    1835                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1836                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1837                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1838                            .dwattr $C$DW$93, DW_AT_decl_line(0x2a5)
    1839                            .dwattr $C$DW$93, DW_AT_decl_column(0x0b)
    1840                    
    1841                    $C$DW$94        .dwtag  DW_TAG_member
    1842                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
    1843                            .dwattr $C$DW$94, DW_AT_name("OUT")
    1844                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("OUT")
    1845                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1846                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1847                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1848                            .dwattr $C$DW$94, DW_AT_decl_line(0x2a6)
    1849                            .dwattr $C$DW$94, DW_AT_decl_column(0x10)
    1850                    
    1851                    $C$DW$95        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   35

    1852                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1853                            .dwattr $C$DW$95, DW_AT_name("RESERVED2")
    1854                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("RESERVED2")
    1855                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1856                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1857                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1858                            .dwattr $C$DW$95, DW_AT_decl_line(0x2a7)
    1859                            .dwattr $C$DW$95, DW_AT_decl_column(0x0b)
    1860                    
    1861                    $C$DW$96        .dwtag  DW_TAG_member
    1862                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
    1863                            .dwattr $C$DW$96, DW_AT_name("DIR")
    1864                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("DIR")
    1865                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1866                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1867                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1868                            .dwattr $C$DW$96, DW_AT_decl_line(0x2a8)
    1869                            .dwattr $C$DW$96, DW_AT_decl_column(0x10)
    1870                    
    1871                    $C$DW$97        .dwtag  DW_TAG_member
    1872                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1873                            .dwattr $C$DW$97, DW_AT_name("RESERVED3")
    1874                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("RESERVED3")
    1875                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1876                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1877                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1878                            .dwattr $C$DW$97, DW_AT_decl_line(0x2a9)
    1879                            .dwattr $C$DW$97, DW_AT_decl_column(0x0b)
    1880                    
    1881                    $C$DW$98        .dwtag  DW_TAG_member
    1882                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
    1883                            .dwattr $C$DW$98, DW_AT_name("REN")
    1884                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("REN")
    1885                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1886                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1887                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1888                            .dwattr $C$DW$98, DW_AT_decl_line(0x2aa)
    1889                            .dwattr $C$DW$98, DW_AT_decl_column(0x10)
    1890                    
    1891                    $C$DW$99        .dwtag  DW_TAG_member
    1892                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1893                            .dwattr $C$DW$99, DW_AT_name("RESERVED4")
    1894                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("RESERVED4")
    1895                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1896                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1897                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1898                            .dwattr $C$DW$99, DW_AT_decl_line(0x2ab)
    1899                            .dwattr $C$DW$99, DW_AT_decl_column(0x0b)
    1900                    
    1901                    $C$DW$100       .dwtag  DW_TAG_member
    1902                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1903                            .dwattr $C$DW$100, DW_AT_name("DS")
    1904                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("DS")
    1905                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1906                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   36

    1907                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1908                            .dwattr $C$DW$100, DW_AT_decl_line(0x2ac)
    1909                            .dwattr $C$DW$100, DW_AT_decl_column(0x10)
    1910                    
    1911                    $C$DW$101       .dwtag  DW_TAG_member
    1912                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1913                            .dwattr $C$DW$101, DW_AT_name("RESERVED5")
    1914                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("RESERVED5")
    1915                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1916                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1917                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1918                            .dwattr $C$DW$101, DW_AT_decl_line(0x2ad)
    1919                            .dwattr $C$DW$101, DW_AT_decl_column(0x0b)
    1920                    
    1921                    $C$DW$102       .dwtag  DW_TAG_member
    1922                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
    1923                            .dwattr $C$DW$102, DW_AT_name("SEL0")
    1924                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("SEL0")
    1925                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1926                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1927                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1928                            .dwattr $C$DW$102, DW_AT_decl_line(0x2ae)
    1929                            .dwattr $C$DW$102, DW_AT_decl_column(0x10)
    1930                    
    1931                    $C$DW$103       .dwtag  DW_TAG_member
    1932                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1933                            .dwattr $C$DW$103, DW_AT_name("RESERVED6")
    1934                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("RESERVED6")
    1935                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1936                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1937                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1938                            .dwattr $C$DW$103, DW_AT_decl_line(0x2af)
    1939                            .dwattr $C$DW$103, DW_AT_decl_column(0x0b)
    1940                    
    1941                    $C$DW$104       .dwtag  DW_TAG_member
    1942                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
    1943                            .dwattr $C$DW$104, DW_AT_name("SEL1")
    1944                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("SEL1")
    1945                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1946                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1947                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1948                            .dwattr $C$DW$104, DW_AT_decl_line(0x2b0)
    1949                            .dwattr $C$DW$104, DW_AT_decl_column(0x10)
    1950                    
    1951                    $C$DW$105       .dwtag  DW_TAG_member
    1952                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$26)
    1953                            .dwattr $C$DW$105, DW_AT_name("RESERVED7")
    1954                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("RESERVED7")
    1955                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1956                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1957                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1958                            .dwattr $C$DW$105, DW_AT_decl_line(0x2b1)
    1959                            .dwattr $C$DW$105, DW_AT_decl_column(0x0b)
    1960                    
    1961                    $C$DW$106       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   37

    1962                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1963                            .dwattr $C$DW$106, DW_AT_name("SELC")
    1964                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("SELC")
    1965                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1966                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1967                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1968                            .dwattr $C$DW$106, DW_AT_decl_line(0x2b2)
    1969                            .dwattr $C$DW$106, DW_AT_decl_column(0x10)
    1970                    
    1971                    $C$DW$107       .dwtag  DW_TAG_member
    1972                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1973                            .dwattr $C$DW$107, DW_AT_name("RESERVED8")
    1974                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("RESERVED8")
    1975                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1976                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1977                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1978                            .dwattr $C$DW$107, DW_AT_decl_line(0x2b3)
    1979                            .dwattr $C$DW$107, DW_AT_decl_column(0x0b)
    1980                    
    1981                    $C$DW$108       .dwtag  DW_TAG_member
    1982                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    1983                            .dwattr $C$DW$108, DW_AT_name("IES")
    1984                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("IES")
    1985                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1986                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1987                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1988                            .dwattr $C$DW$108, DW_AT_decl_line(0x2b4)
    1989                            .dwattr $C$DW$108, DW_AT_decl_column(0x10)
    1990                    
    1991                    $C$DW$109       .dwtag  DW_TAG_member
    1992                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1993                            .dwattr $C$DW$109, DW_AT_name("RESERVED9")
    1994                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("RESERVED9")
    1995                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1996                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1997                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1998                            .dwattr $C$DW$109, DW_AT_decl_line(0x2b5)
    1999                            .dwattr $C$DW$109, DW_AT_decl_column(0x0b)
    2000                    
    2001                    $C$DW$110       .dwtag  DW_TAG_member
    2002                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    2003                            .dwattr $C$DW$110, DW_AT_name("IE")
    2004                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("IE")
    2005                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2006                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2007                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    2008                            .dwattr $C$DW$110, DW_AT_decl_line(0x2b6)
    2009                            .dwattr $C$DW$110, DW_AT_decl_column(0x10)
    2010                    
    2011                    $C$DW$111       .dwtag  DW_TAG_member
    2012                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2013                            .dwattr $C$DW$111, DW_AT_name("RESERVED10")
    2014                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("RESERVED10")
    2015                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2016                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   38

    2017                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    2018                            .dwattr $C$DW$111, DW_AT_decl_line(0x2b7)
    2019                            .dwattr $C$DW$111, DW_AT_decl_column(0x0b)
    2020                    
    2021                    $C$DW$112       .dwtag  DW_TAG_member
    2022                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    2023                            .dwattr $C$DW$112, DW_AT_name("IFG")
    2024                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("IFG")
    2025                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2026                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2027                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    2028                            .dwattr $C$DW$112, DW_AT_decl_line(0x2b8)
    2029                            .dwattr $C$DW$112, DW_AT_decl_column(0x10)
    2030                    
    2031                    $C$DW$113       .dwtag  DW_TAG_member
    2032                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$23)
    2033                            .dwattr $C$DW$113, DW_AT_name("IV")
    2034                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("IV")
    2035                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2036                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2037                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    2038                            .dwattr $C$DW$113, DW_AT_decl_line(0x2b9)
    2039                            .dwattr $C$DW$113, DW_AT_decl_column(0x10)
    2040                    
    2041                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    2042                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2a2)
    2043                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2044                            .dwendtag $C$DW$T$27
    2045                    
    2046                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    2047                            .dwattr $C$DW$T$174, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    2048                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$27)
    2049                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    2050                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    2051                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x2ba)
    2052                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x03)
    2053                    
    2054                    
    2055                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2056                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2057                    $C$DW$114       .dwtag  DW_TAG_member
    2058                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$28)
    2059                            .dwattr $C$DW$114, DW_AT_name("_reserved0")
    2060                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("_reserved0")
    2061                            .dwattr $C$DW$114, DW_AT_bit_offset(0x10)
    2062                            .dwattr $C$DW$114, DW_AT_bit_size(0x10)
    2063                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2064                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2065                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2066                            .dwattr $C$DW$114, DW_AT_decl_line(0x105)
    2067                            .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    2068                    
    2069                    $C$DW$115       .dwtag  DW_TAG_member
    2070                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$28)
    2071                            .dwattr $C$DW$115, DW_AT_name("GE")
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   39

    2072                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("GE")
    2073                            .dwattr $C$DW$115, DW_AT_bit_offset(0x0c)
    2074                            .dwattr $C$DW$115, DW_AT_bit_size(0x04)
    2075                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2076                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2077                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2078                            .dwattr $C$DW$115, DW_AT_decl_line(0x106)
    2079                            .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    2080                    
    2081                    $C$DW$116       .dwtag  DW_TAG_member
    2082                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$28)
    2083                            .dwattr $C$DW$116, DW_AT_name("_reserved1")
    2084                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("_reserved1")
    2085                            .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    2086                            .dwattr $C$DW$116, DW_AT_bit_size(0x07)
    2087                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2088                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2089                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2090                            .dwattr $C$DW$116, DW_AT_decl_line(0x107)
    2091                            .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    2092                    
    2093                    $C$DW$117       .dwtag  DW_TAG_member
    2094                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$28)
    2095                            .dwattr $C$DW$117, DW_AT_name("Q")
    2096                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("Q")
    2097                            .dwattr $C$DW$117, DW_AT_bit_offset(0x04)
    2098                            .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    2099                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2102                            .dwattr $C$DW$117, DW_AT_decl_line(0x108)
    2103                            .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    2104                    
    2105                    $C$DW$118       .dwtag  DW_TAG_member
    2106                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$28)
    2107                            .dwattr $C$DW$118, DW_AT_name("V")
    2108                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("V")
    2109                            .dwattr $C$DW$118, DW_AT_bit_offset(0x03)
    2110                            .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    2111                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2113                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2114                            .dwattr $C$DW$118, DW_AT_decl_line(0x109)
    2115                            .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    2116                    
    2117                    $C$DW$119       .dwtag  DW_TAG_member
    2118                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$28)
    2119                            .dwattr $C$DW$119, DW_AT_name("C")
    2120                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("C")
    2121                            .dwattr $C$DW$119, DW_AT_bit_offset(0x02)
    2122                            .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    2123                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2124                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2125                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2126                            .dwattr $C$DW$119, DW_AT_decl_line(0x10a)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   40

    2127                            .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
    2128                    
    2129                    $C$DW$120       .dwtag  DW_TAG_member
    2130                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$28)
    2131                            .dwattr $C$DW$120, DW_AT_name("Z")
    2132                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("Z")
    2133                            .dwattr $C$DW$120, DW_AT_bit_offset(0x01)
    2134                            .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    2135                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2136                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2137                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2138                            .dwattr $C$DW$120, DW_AT_decl_line(0x10b)
    2139                            .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    2140                    
    2141                    $C$DW$121       .dwtag  DW_TAG_member
    2142                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$28)
    2143                            .dwattr $C$DW$121, DW_AT_name("N")
    2144                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("N")
    2145                            .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    2146                            .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    2147                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2148                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2149                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2150                            .dwattr $C$DW$121, DW_AT_decl_line(0x10c)
    2151                            .dwattr $C$DW$121, DW_AT_decl_column(0x0e)
    2152                    
    2153                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2154                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x104)
    2155                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    2156                            .dwendtag $C$DW$T$29
    2157                    
    2158                    
    2159                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2160                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2161                    $C$DW$122       .dwtag  DW_TAG_member
    2162                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$28)
    2163                            .dwattr $C$DW$122, DW_AT_name("ISR")
    2164                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("ISR")
    2165                            .dwattr $C$DW$122, DW_AT_bit_offset(0x17)
    2166                            .dwattr $C$DW$122, DW_AT_bit_size(0x09)
    2167                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2168                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2169                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2170                            .dwattr $C$DW$122, DW_AT_decl_line(0x12c)
    2171                            .dwattr $C$DW$122, DW_AT_decl_column(0x0e)
    2172                    
    2173                    $C$DW$123       .dwtag  DW_TAG_member
    2174                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$28)
    2175                            .dwattr $C$DW$123, DW_AT_name("_reserved0")
    2176                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("_reserved0")
    2177                            .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2178                            .dwattr $C$DW$123, DW_AT_bit_size(0x17)
    2179                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2181                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   41

    2182                            .dwattr $C$DW$123, DW_AT_decl_line(0x12d)
    2183                            .dwattr $C$DW$123, DW_AT_decl_column(0x0e)
    2184                    
    2185                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2186                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x12b)
    2187                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    2188                            .dwendtag $C$DW$T$30
    2189                    
    2190                    
    2191                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2192                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2193                    $C$DW$124       .dwtag  DW_TAG_member
    2194                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$28)
    2195                            .dwattr $C$DW$124, DW_AT_name("ISR")
    2196                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("ISR")
    2197                            .dwattr $C$DW$124, DW_AT_bit_offset(0x17)
    2198                            .dwattr $C$DW$124, DW_AT_bit_size(0x09)
    2199                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2201                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2202                            .dwattr $C$DW$124, DW_AT_decl_line(0x13e)
    2203                            .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    2204                    
    2205                    $C$DW$125       .dwtag  DW_TAG_member
    2206                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$28)
    2207                            .dwattr $C$DW$125, DW_AT_name("_reserved0")
    2208                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("_reserved0")
    2209                            .dwattr $C$DW$125, DW_AT_bit_offset(0x16)
    2210                            .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    2211                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2213                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2214                            .dwattr $C$DW$125, DW_AT_decl_line(0x13f)
    2215                            .dwattr $C$DW$125, DW_AT_decl_column(0x0e)
    2216                    
    2217                    $C$DW$126       .dwtag  DW_TAG_member
    2218                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$28)
    2219                            .dwattr $C$DW$126, DW_AT_name("ICI_IT_1")
    2220                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("ICI_IT_1")
    2221                            .dwattr $C$DW$126, DW_AT_bit_offset(0x10)
    2222                            .dwattr $C$DW$126, DW_AT_bit_size(0x06)
    2223                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2224                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2225                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2226                            .dwattr $C$DW$126, DW_AT_decl_line(0x140)
    2227                            .dwattr $C$DW$126, DW_AT_decl_column(0x0e)
    2228                    
    2229                    $C$DW$127       .dwtag  DW_TAG_member
    2230                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$28)
    2231                            .dwattr $C$DW$127, DW_AT_name("GE")
    2232                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("GE")
    2233                            .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
    2234                            .dwattr $C$DW$127, DW_AT_bit_size(0x04)
    2235                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   42

    2237                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2238                            .dwattr $C$DW$127, DW_AT_decl_line(0x141)
    2239                            .dwattr $C$DW$127, DW_AT_decl_column(0x0e)
    2240                    
    2241                    $C$DW$128       .dwtag  DW_TAG_member
    2242                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$28)
    2243                            .dwattr $C$DW$128, DW_AT_name("_reserved1")
    2244                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("_reserved1")
    2245                            .dwattr $C$DW$128, DW_AT_bit_offset(0x08)
    2246                            .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    2247                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2249                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2250                            .dwattr $C$DW$128, DW_AT_decl_line(0x142)
    2251                            .dwattr $C$DW$128, DW_AT_decl_column(0x0e)
    2252                    
    2253                    $C$DW$129       .dwtag  DW_TAG_member
    2254                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$28)
    2255                            .dwattr $C$DW$129, DW_AT_name("T")
    2256                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("T")
    2257                            .dwattr $C$DW$129, DW_AT_bit_offset(0x07)
    2258                            .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2259                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2261                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2262                            .dwattr $C$DW$129, DW_AT_decl_line(0x143)
    2263                            .dwattr $C$DW$129, DW_AT_decl_column(0x0e)
    2264                    
    2265                    $C$DW$130       .dwtag  DW_TAG_member
    2266                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$28)
    2267                            .dwattr $C$DW$130, DW_AT_name("ICI_IT_2")
    2268                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("ICI_IT_2")
    2269                            .dwattr $C$DW$130, DW_AT_bit_offset(0x05)
    2270                            .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    2271                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2272                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2273                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2274                            .dwattr $C$DW$130, DW_AT_decl_line(0x144)
    2275                            .dwattr $C$DW$130, DW_AT_decl_column(0x0e)
    2276                    
    2277                    $C$DW$131       .dwtag  DW_TAG_member
    2278                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$28)
    2279                            .dwattr $C$DW$131, DW_AT_name("Q")
    2280                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("Q")
    2281                            .dwattr $C$DW$131, DW_AT_bit_offset(0x04)
    2282                            .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2283                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2284                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2285                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2286                            .dwattr $C$DW$131, DW_AT_decl_line(0x145)
    2287                            .dwattr $C$DW$131, DW_AT_decl_column(0x0e)
    2288                    
    2289                    $C$DW$132       .dwtag  DW_TAG_member
    2290                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$28)
    2291                            .dwattr $C$DW$132, DW_AT_name("V")
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   43

    2292                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("V")
    2293                            .dwattr $C$DW$132, DW_AT_bit_offset(0x03)
    2294                            .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2295                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2297                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2298                            .dwattr $C$DW$132, DW_AT_decl_line(0x146)
    2299                            .dwattr $C$DW$132, DW_AT_decl_column(0x0e)
    2300                    
    2301                    $C$DW$133       .dwtag  DW_TAG_member
    2302                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$28)
    2303                            .dwattr $C$DW$133, DW_AT_name("C")
    2304                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("C")
    2305                            .dwattr $C$DW$133, DW_AT_bit_offset(0x02)
    2306                            .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2307                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2309                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2310                            .dwattr $C$DW$133, DW_AT_decl_line(0x147)
    2311                            .dwattr $C$DW$133, DW_AT_decl_column(0x0e)
    2312                    
    2313                    $C$DW$134       .dwtag  DW_TAG_member
    2314                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$28)
    2315                            .dwattr $C$DW$134, DW_AT_name("Z")
    2316                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("Z")
    2317                            .dwattr $C$DW$134, DW_AT_bit_offset(0x01)
    2318                            .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2319                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2321                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2322                            .dwattr $C$DW$134, DW_AT_decl_line(0x148)
    2323                            .dwattr $C$DW$134, DW_AT_decl_column(0x0e)
    2324                    
    2325                    $C$DW$135       .dwtag  DW_TAG_member
    2326                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$28)
    2327                            .dwattr $C$DW$135, DW_AT_name("N")
    2328                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("N")
    2329                            .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    2330                            .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2331                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2333                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2334                            .dwattr $C$DW$135, DW_AT_decl_line(0x149)
    2335                            .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    2336                    
    2337                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2338                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x13d)
    2339                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    2340                            .dwendtag $C$DW$T$31
    2341                    
    2342                    
    2343                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2344                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    2345                    $C$DW$136       .dwtag  DW_TAG_member
    2346                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$28)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   44

    2347                            .dwattr $C$DW$136, DW_AT_name("nPRIV")
    2348                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("nPRIV")
    2349                            .dwattr $C$DW$136, DW_AT_bit_offset(0x1f)
    2350                            .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2351                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2352                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2353                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2354                            .dwattr $C$DW$136, DW_AT_decl_line(0x175)
    2355                            .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2356                    
    2357                    $C$DW$137       .dwtag  DW_TAG_member
    2358                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$28)
    2359                            .dwattr $C$DW$137, DW_AT_name("SPSEL")
    2360                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("SPSEL")
    2361                            .dwattr $C$DW$137, DW_AT_bit_offset(0x1e)
    2362                            .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2363                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2364                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2365                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2366                            .dwattr $C$DW$137, DW_AT_decl_line(0x176)
    2367                            .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2368                    
    2369                    $C$DW$138       .dwtag  DW_TAG_member
    2370                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$28)
    2371                            .dwattr $C$DW$138, DW_AT_name("FPCA")
    2372                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("FPCA")
    2373                            .dwattr $C$DW$138, DW_AT_bit_offset(0x1d)
    2374                            .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2375                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2376                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2377                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2378                            .dwattr $C$DW$138, DW_AT_decl_line(0x177)
    2379                            .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2380                    
    2381                    $C$DW$139       .dwtag  DW_TAG_member
    2382                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$28)
    2383                            .dwattr $C$DW$139, DW_AT_name("_reserved0")
    2384                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("_reserved0")
    2385                            .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2386                            .dwattr $C$DW$139, DW_AT_bit_size(0x1d)
    2387                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2388                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2389                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2390                            .dwattr $C$DW$139, DW_AT_decl_line(0x178)
    2391                            .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2392                    
    2393                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2394                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x174)
    2395                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    2396                            .dwendtag $C$DW$T$32
    2397                    
    2398                    
    2399                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2400                            .dwattr $C$DW$T$39, DW_AT_byte_size(0xe04)
    2401                    $C$DW$140       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   45

    2402                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$34)
    2403                            .dwattr $C$DW$140, DW_AT_name("ISER")
    2404                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("ISER")
    2405                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2406                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2407                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2408                            .dwattr $C$DW$140, DW_AT_decl_line(0x196)
    2409                            .dwattr $C$DW$140, DW_AT_decl_column(0x12)
    2410                    
    2411                    $C$DW$141       .dwtag  DW_TAG_member
    2412                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$35)
    2413                            .dwattr $C$DW$141, DW_AT_name("RESERVED0")
    2414                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("RESERVED0")
    2415                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2416                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2417                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2418                            .dwattr $C$DW$141, DW_AT_decl_line(0x197)
    2419                            .dwattr $C$DW$141, DW_AT_decl_column(0x12)
    2420                    
    2421                    $C$DW$142       .dwtag  DW_TAG_member
    2422                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$34)
    2423                            .dwattr $C$DW$142, DW_AT_name("ICER")
    2424                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("ICER")
    2425                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2426                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2427                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2428                            .dwattr $C$DW$142, DW_AT_decl_line(0x198)
    2429                            .dwattr $C$DW$142, DW_AT_decl_column(0x12)
    2430                    
    2431                    $C$DW$143       .dwtag  DW_TAG_member
    2432                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$35)
    2433                            .dwattr $C$DW$143, DW_AT_name("RSERVED1")
    2434                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("RSERVED1")
    2435                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2436                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2437                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2438                            .dwattr $C$DW$143, DW_AT_decl_line(0x199)
    2439                            .dwattr $C$DW$143, DW_AT_decl_column(0x12)
    2440                    
    2441                    $C$DW$144       .dwtag  DW_TAG_member
    2442                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$34)
    2443                            .dwattr $C$DW$144, DW_AT_name("ISPR")
    2444                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("ISPR")
    2445                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2446                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2447                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2448                            .dwattr $C$DW$144, DW_AT_decl_line(0x19a)
    2449                            .dwattr $C$DW$144, DW_AT_decl_column(0x12)
    2450                    
    2451                    $C$DW$145       .dwtag  DW_TAG_member
    2452                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$35)
    2453                            .dwattr $C$DW$145, DW_AT_name("RESERVED2")
    2454                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("RESERVED2")
    2455                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2456                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   46

    2457                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2458                            .dwattr $C$DW$145, DW_AT_decl_line(0x19b)
    2459                            .dwattr $C$DW$145, DW_AT_decl_column(0x12)
    2460                    
    2461                    $C$DW$146       .dwtag  DW_TAG_member
    2462                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$34)
    2463                            .dwattr $C$DW$146, DW_AT_name("ICPR")
    2464                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("ICPR")
    2465                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    2466                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2467                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2468                            .dwattr $C$DW$146, DW_AT_decl_line(0x19c)
    2469                            .dwattr $C$DW$146, DW_AT_decl_column(0x12)
    2470                    
    2471                    $C$DW$147       .dwtag  DW_TAG_member
    2472                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$35)
    2473                            .dwattr $C$DW$147, DW_AT_name("RESERVED3")
    2474                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("RESERVED3")
    2475                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    2476                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2477                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2478                            .dwattr $C$DW$147, DW_AT_decl_line(0x19d)
    2479                            .dwattr $C$DW$147, DW_AT_decl_column(0x12)
    2480                    
    2481                    $C$DW$148       .dwtag  DW_TAG_member
    2482                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$34)
    2483                            .dwattr $C$DW$148, DW_AT_name("IABR")
    2484                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("IABR")
    2485                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    2486                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2487                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2488                            .dwattr $C$DW$148, DW_AT_decl_line(0x19e)
    2489                            .dwattr $C$DW$148, DW_AT_decl_column(0x12)
    2490                    
    2491                    $C$DW$149       .dwtag  DW_TAG_member
    2492                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$36)
    2493                            .dwattr $C$DW$149, DW_AT_name("RESERVED4")
    2494                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("RESERVED4")
    2495                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    2496                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2497                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2498                            .dwattr $C$DW$149, DW_AT_decl_line(0x19f)
    2499                            .dwattr $C$DW$149, DW_AT_decl_column(0x12)
    2500                    
    2501                    $C$DW$150       .dwtag  DW_TAG_member
    2502                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$37)
    2503                            .dwattr $C$DW$150, DW_AT_name("IP")
    2504                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("IP")
    2505                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    2506                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2507                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2508                            .dwattr $C$DW$150, DW_AT_decl_line(0x1a0)
    2509                            .dwattr $C$DW$150, DW_AT_decl_column(0x12)
    2510                    
    2511                    $C$DW$151       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   47

    2512                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$38)
    2513                            .dwattr $C$DW$151, DW_AT_name("RESERVED5")
    2514                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("RESERVED5")
    2515                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    2516                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2517                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2518                            .dwattr $C$DW$151, DW_AT_decl_line(0x1a1)
    2519                            .dwattr $C$DW$151, DW_AT_decl_column(0x12)
    2520                    
    2521                    $C$DW$152       .dwtag  DW_TAG_member
    2522                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$33)
    2523                            .dwattr $C$DW$152, DW_AT_name("STIR")
    2524                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("STIR")
    2525                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    2526                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2527                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2528                            .dwattr $C$DW$152, DW_AT_decl_line(0x1a2)
    2529                            .dwattr $C$DW$152, DW_AT_decl_column(0x12)
    2530                    
    2531                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2532                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x195)
    2533                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2534                            .dwendtag $C$DW$T$39
    2535                    
    2536                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    2537                            .dwattr $C$DW$T$176, DW_AT_name("NVIC_Type")
    2538                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$39)
    2539                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    2540                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2541                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x1a3)
    2542                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x04)
    2543                    
    2544                    
    2545                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2546                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x8c)
    2547                    $C$DW$153       .dwtag  DW_TAG_member
    2548                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$40)
    2549                            .dwattr $C$DW$153, DW_AT_name("CPUID")
    2550                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("CPUID")
    2551                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2552                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2553                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2554                            .dwattr $C$DW$153, DW_AT_decl_line(0x1b8)
    2555                            .dwattr $C$DW$153, DW_AT_decl_column(0x12)
    2556                    
    2557                    $C$DW$154       .dwtag  DW_TAG_member
    2558                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$33)
    2559                            .dwattr $C$DW$154, DW_AT_name("ICSR")
    2560                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("ICSR")
    2561                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2562                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2563                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2564                            .dwattr $C$DW$154, DW_AT_decl_line(0x1b9)
    2565                            .dwattr $C$DW$154, DW_AT_decl_column(0x12)
    2566                    
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   48

    2567                    $C$DW$155       .dwtag  DW_TAG_member
    2568                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$33)
    2569                            .dwattr $C$DW$155, DW_AT_name("VTOR")
    2570                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("VTOR")
    2571                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2572                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2573                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2574                            .dwattr $C$DW$155, DW_AT_decl_line(0x1ba)
    2575                            .dwattr $C$DW$155, DW_AT_decl_column(0x12)
    2576                    
    2577                    $C$DW$156       .dwtag  DW_TAG_member
    2578                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$33)
    2579                            .dwattr $C$DW$156, DW_AT_name("AIRCR")
    2580                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("AIRCR")
    2581                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2582                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2583                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2584                            .dwattr $C$DW$156, DW_AT_decl_line(0x1bb)
    2585                            .dwattr $C$DW$156, DW_AT_decl_column(0x12)
    2586                    
    2587                    $C$DW$157       .dwtag  DW_TAG_member
    2588                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$33)
    2589                            .dwattr $C$DW$157, DW_AT_name("SCR")
    2590                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("SCR")
    2591                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2592                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2593                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2594                            .dwattr $C$DW$157, DW_AT_decl_line(0x1bc)
    2595                            .dwattr $C$DW$157, DW_AT_decl_column(0x12)
    2596                    
    2597                    $C$DW$158       .dwtag  DW_TAG_member
    2598                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$33)
    2599                            .dwattr $C$DW$158, DW_AT_name("CCR")
    2600                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("CCR")
    2601                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2602                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2603                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2604                            .dwattr $C$DW$158, DW_AT_decl_line(0x1bd)
    2605                            .dwattr $C$DW$158, DW_AT_decl_column(0x12)
    2606                    
    2607                    $C$DW$159       .dwtag  DW_TAG_member
    2608                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$41)
    2609                            .dwattr $C$DW$159, DW_AT_name("SHP")
    2610                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("SHP")
    2611                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2612                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2613                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2614                            .dwattr $C$DW$159, DW_AT_decl_line(0x1be)
    2615                            .dwattr $C$DW$159, DW_AT_decl_column(0x12)
    2616                    
    2617                    $C$DW$160       .dwtag  DW_TAG_member
    2618                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$33)
    2619                            .dwattr $C$DW$160, DW_AT_name("SHCSR")
    2620                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("SHCSR")
    2621                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TI ARM Assembler PC v16.9.6 Fri Nov 12 13:15:22 2021

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   49

    2622                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2623                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2624                            .dwattr $C$DW$160, DW_AT_decl_line(0x1bf)
    2625                            .dwattr $C$DW$160, DW_AT_decl_column(0x12)
    2626                    
    2627                    $C$DW$161       .dwtag  DW_TAG_member
    2628                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$33)
    2629                            .dwattr $C$DW$161, DW_AT_name("CFSR")
    2630                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("CFSR")
    2631                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2632                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2633                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2634                            .dwattr $C$DW$161, DW_AT_decl_line(0x1c0)
    2635                            .dwattr $C$DW$161, DW_AT_decl_column(0x12)
    2636                    
    2637                    $C$DW$162       .dwtag  DW_TAG_member
    2638                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$33)
    2639                            .dwattr $C$DW$162, DW_AT_name("HFSR")
    2640                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("HFSR")
    2641                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2642                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2643                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2644                            .dwattr $C$DW$162, DW_AT_decl_line(0x1c1)
    2645                            .dwattr $C$DW$162, DW_AT_decl_column(0x12)
    2646                    
    2647                    $C$DW$163       .dwtag  DW_TAG_member
    2648                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$33)
    2649                            .dwattr $C$DW$163, DW_AT_name("DFSR")
    2650                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("DFSR")
    2651                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2652                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2653                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2654                            .dwattr $C$DW$163, DW_AT_decl_line(0x1c2)
    2655                            .dwattr $C$DW$163, DW_AT_decl_column(0x12)
    2656                    
    2657                    $C$DW$164       .dwtag  DW_TAG_member
    2658                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$33)
    2659                            .dwattr $C$DW$164, DW_AT_name("MMFAR")
    2660                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("MMFAR")
    2661                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2662                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
